const s = {
  "小寒": ['寒夜客来茶当酒，竹炉汤沸火初红。', '寒夜客来茶当酒，竹炉汤沸火初红。', '寒夜客来茶当酒，竹炉汤沸火初红。', '寒夜客来茶当酒，竹炉汤沸火初红。'],
  "大寒": ['平明羸马出西门，淡日寒云久吐吞。', '平明羸马出西门，淡日寒云久吐吞。', '平明羸马出西门，淡日寒云久吐吞。', '平明羸马出西门，淡日寒云久吐吞。'],
  "立春": ['无端风雨，未肯收尽馀寒。', '柳色早黄浅，水文新绿微。', '生怕见花开花落，朝来塞雁先还。', '律回岁晚冰霜少，春到人间草木知。'],
  "雨水": ['世味年来薄似纱，谁令骑马客京华。', '世味年来薄似纱，谁令骑马客京华。', '小楼一夜听春雨，深巷明朝卖杏花。', '小楼一夜听春雨，深巷明朝卖杏花。'],
  "惊蛰": ['幽蛰夜惊雷奋地，小窗朝爽日筛帘。', '白雪却嫌春色晚，故穿庭树作飞花。', '京口瓜洲一水间，钟山只隔数重山。', '今夜偏知春气暖，虫声新透绿窗纱。'],
  "春分": ['应惭落地梅花识，却作漫天柳絮飞。', '江南无所有，聊赠一枝春。', '正是闲时无客过，小庭斜日倚阑干。', '蓦然旧事上心来，无言敛皱眉山翠。'],
  "清明": ['燕子来时新社，梨花落后清明。', '青梅如豆柳如眉，日长蝴蝶飞。', '南园春半踏青时，风和闻马嘶。', '独绕回廊行复歇，遥听弦管暗看花。'],
  "谷雨": ['谷雨春光晓，山川黛色青。', '叶间鸣戴胜，泽水长浮萍。', '十年樱笋江南梦，最爱苕溪隐士家。', '一夜剪刀收玉蕊。'],
  "立夏": ['晨起披衣出草堂，轩窗已自喜微凉。', '余春只有二三日，烂醉恨无千百场。', '余春只有二三日，烂醉恨无千百场。', '余春只有二三日，烂醉恨无千百场。'],
  "小满": ['野棠梨密啼晚莺，海石榴红啭山鸟。', '绿阴不减来时路，添得黄鹂四五声。', '田家少闲月，五月人倍忙。', '夜莺啼绿柳，皓月醒长空。'],
  "芒种": ['绿阴不减来时路，添得黄鹂四五声。', '试问闲愁都几许？一川烟草，满城风絮，梅子黄时雨。', '田家少闲月，五月人倍忙。', '有约不来过夜半，闲敲棋子落灯花。'],
  "夏至": ['试问闲愁都几许？一川烟草，满城风絮，梅子黄时雨。', '接天莲叶无穷碧，映日荷花别样红。', '梅子留酸软齿牙，芭蕉分绿与窗纱。', '梅子留酸软齿牙，芭蕉分绿与窗纱。'],
  "小暑": ['连雨不知春去，一晴方觉夏深。', '连雨不知春去，一晴方觉夏深。', '一庭疏竹间芭蕉，风也潇潇，雨也潇潇。', '明月别枝惊鹊，清风半夜鸣蝉。'],
  "大暑": ['何时为洗秋空热，散作霜天落叶风。', '何以销烦暑，端居一院中。', '绿树阴浓夏日长，楼台倒影入池塘。', '水精帘动微风起，满架蔷薇一院香。'],
  "立秋": ['草木欲摇落，翛然天地清。', '林塘消暑气，砧杵动秋声。', '林塘消暑气，砧杵动秋声。', '睡起秋生无觅处，满阶梧桐月明中。'],
  "处暑": ['草木欲摇落，翛然天地清。', '林塘消暑气，砧杵动秋声。', '林塘消暑气，砧杵动秋声。', '睡起秋生无觅处，满阶梧桐月明中。'],
  "白露": ['蒹葭苍苍，白露为霜。', '白露团甘子，清晨散马蹄。', '却下水晶帘，玲珑望秋月。', '却下水晶帘，玲珑望秋月。'],
  "秋分": ['自古逢秋悲寂寥，我言秋日胜春朝。', '晴空一鹤排云上，便引诗情到碧霄。', '复恐匆匆说不尽，行人临发又开封。', '因思杜陵梦，凫雁满回塘。'],
  "寒露": ['人烟寒橘柚，秋色老梧桐。', '人烟寒橘柚，秋色老梧桐。', '芳草无情，更在斜阳外。', '明月楼高休独倚，酒入愁肠，化作相思泪。'],
  "霜降": ['山路元无雨，空翠湿人衣。', '青门须醉别，少为解征鞍。', '停车坐爱枫林晚，霜叶红于二月花。', '姑苏城外寒山寺，夜半钟声到客船。'],
  "立冬": ['草枯鹰眼疾，雪尽马蹄轻。', '回看射雕处，千里暮云平。', '落水荷塘满眼枯，西风渐作北风呼。', '拟约三九吟梅雪，还借自家小火炉。'],
  "小雪": ['片片互玲珑，飞扬玉漏终。', '篱菊尽来低覆水，塞鸿飞去远连霞。', '篱菊尽来低覆水，塞鸿飞去远连霞。', '片片互玲珑，飞扬玉漏终。'],
  "大雪": ['梅须逊雪三分白，雪却输梅一段香。', '有梅无雪不精神，有雪无诗俗了人。', '千山鸟飞绝，万径人踪灭。', '夜深知雪重，时闻折竹声。'],
  "冬至": ['江山如此多娇，引无数英雄竞折腰。', '念桥边红药，年年知为谁生？', '年年至日长为客，忽忽穷愁泥杀人。', '柴门闻犬吠，风雪夜归人。']
}

const g = ['早上好', '中午好', '下午好', '晚上好']

const sTermInfo = new Array(0, 21208, 42467, 63836, 85337, 107014, 128867, 150921, 173149, 195551, 218072, 240693, 263343, 285989, 308563, 331033, 353350, 375494, 397447, 419210, 440795, 462224, 483532, 504758)
const solarTerm = new Array('小寒', '大寒', '立春', '雨水', '惊蛰', '春分', '清明', '谷雨', '立夏', '小满', '芒种', '夏至', '小暑', '大暑', '立秋', '处暑', '白露', '秋分', '寒露', '霜降', '立冬', '小雪', '大雪', '冬至')

export const greet = (() => {
  const date = new Date()
  const ret = {}
  const h = date.getHours()
  let i = 0
  if (h >= 11) i++
  if (h >= 13) i++
  if (h >= 18) i++
  ret.g = g[i]

  // copied from internet :)
  let y = date.getFullYear()
  let m = date.getMonth()
  let d = date.getDate()
  let solarTerms = ''
  while (!solarTerms) { 
    let tmp1 = new Date((31556925974.7 * (y - 1900) + sTermInfo[m * 2 + 1] * 60000) + Date.UTC(1900, 0, 6, 2, 5))
    let tmp2 = tmp1.getUTCDate()
    if (tmp2 == d) solarTerms = solarTerm[m * 2 + 1]
    tmp1 = new Date((31556925974.7 * (y - 1900) + sTermInfo[m * 2] * 60000) + Date.UTC(1900, 0, 6, 2, 5))
    tmp2 = tmp1.getUTCDate()
    if (tmp2 == d) solarTerms = solarTerm[m * 2]
    if (d > 1) {
      d = d - 1 
    } else {
      m = m - 1 
      if (m < 0) { 
        y = y - 1
        m = 11 
      }
    　d = 31 
    } 
  }

  ret.s = s[solarTerms][i]
  return ret
})()