const s = [[
    '草枯鹰眼疾，雪尽马蹄轻。——王维',
    '回看射雕处，千里暮云平。——王维',
    '绿蚁新醅酒，红泥小火炉。——白居易',
    '片片互玲珑，飞扬玉漏终。——无可',
    '梅须逊雪三分白，雪却输梅一段香。——卢梅坡', 
    '有梅无雪不精神，有雪无诗俗了人。——卢梅坡', 
    '千山鸟飞绝，万径人踪灭。——柳宗元', 
    '夜深知雪重，时闻折竹声。——白居易',
    '年年至日长为客，忽忽穷愁泥杀人。——杜甫', 
    '柴门闻犬吠，风雪夜归人。——刘长卿', 
    '寒夜客来茶当酒，竹炉汤沸火初红。——杜耒', 
    '平明羸马出西门，淡日寒云久吐吞。——陆游',
    '你是花朵素裹银妆降临后让世界晶莹透亮，点缀了深冬满目琳琅。——流年如歌',
    '其实地上本没有路，走的人多了，也便成了路。'
  ], [
    '不知细叶谁裁出，二月春风似剪刀。——贺知章', 
    '柳色早黄浅，水文新绿微。——白居易', 
    '人闲桂花落，夜静春山空。——王维',
    '律回岁晚冰霜少，春到人间草木知。——张栻', 
    '小楼一夜听春雨，深巷明朝卖杏花。——陆游', 
    '白雪却嫌春色晚，故穿庭树作飞花。——韩愈', 
    '春风又绿江南岸，明月何时照我还。——王安石', 
    '草长莺飞二月天，拂堤杨柳醉春烟。——高鼎',
    '红酥手，黄縢酒，满城春色宫墙柳。——陆游',
    '乱花渐欲迷人眼，浅草才能没马蹄。——白居易',
    '江流宛转绕芳甸，月照花林皆似霰。——张若虚',
    '最是一年春好处，绝胜烟柳满皇都。——韩愈',
    '一夜剪刀收玉蕊。——苏轼',
    '休对故人思故国，且将新火试新茶，诗酒趁年华。——苏轼',
    '苟利国家生死以，岂因祸福避趋之。'
  ], [
    '绿阴不减来时路，添得黄鹂四五声。——曾几', 
    '试问闲愁都几许？一川烟草，满城风絮，梅子黄时雨。——贺铸', 
    '有约不来过夜半，闲敲棋子落灯花。——赵师秀', 
    '接天莲叶无穷碧，映日荷花别样红。——杨万里', 
    '梅子留酸软齿牙，芭蕉分绿与窗纱。——杨万里', 
    '连雨不知春去，一晴方觉夏深。——范成大', 
    '一庭疏竹间芭蕉，风也潇潇，雨也潇潇。', 
    '明月别枝惊鹊，清风半夜鸣蝉。——辛弃疾', 
    '绿树阴浓夏日长，楼台倒影入池塘。——高骈', 
    '水精帘动微风起，满架蔷薇一院香。——高骈',
    '你是清风拂过荷塘掀起回忆化作漫天星光，璀璨了盛夏如梦一场。——流年如歌',
    '跑得快不一定赢，不跌跟头才是成功。'
  ], [
    '草木欲摇落，翛然天地清。——惠远谟', 
    '林塘消暑气，砧杵动秋声。——惠远谟', 
    '睡起秋声无觅处，满阶梧叶月明中。——刘翰', 
    '蒹葭苍苍，白露为霜，所谓伊人，在水一方。——《诗经》', 
    '白露团甘子，清晨散马蹄。——杜甫', 
    '却下水晶帘，玲珑望秋月。——李白', 
    '自古逢秋悲寂寥，我言秋日胜春朝。——刘禹锡', 
    '晴空一鹤排云上，便引诗情到碧霄。——刘禹锡', 
    '因思杜陵梦，凫雁满回塘。——温庭筠', 
    '人烟寒橘柚，秋色老梧桐。——李白', 
    '芳草无情，更在斜阳外。——范仲淹', 
    '明月楼高休独倚，酒入愁肠，化作相思泪。——范仲淹',
    '停车坐爱枫林晚，霜叶红于二月花。——杜牧', 
    '姑苏城外寒山寺，夜半钟声到客船。——张继',
    '我买几个橘子去。你就在此地，不要走动。'
  ]
]

const g = ['早上好', '中午好', '下午好', '晚上好']
const date = new Date()
const h = date.getHours(), m = date.getMonth()
let i = 0, j = 0
if (h >= 11) i++
if (h >= 13) i++
if (h >= 18) i++
if (m > 1) j++
if (m > 4) j++
if (m > 7) j++
if (m > 10) j = 0
const r = s[j][Math.floor(s[j].length * Math.random())]
export const greet = { g: g[i], s: r }
